
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/takahashigo/aws-ecs-terraform/actions/runs/6032349459)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-07206b77599279d94]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f02832e78f6e2dfe]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00e434556ea5e2b8f]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a0df0b3cac51798e]
aws_security_group.ecs: Refreshing state... [id=sg-033f317a466bc3a00]
aws_security_group.alb: Refreshing state... [id=sg-03615ef4987605c19]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-080560f406407f15a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09c7fbaa592d41099]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b0153885fce04ca4]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06a85a3185ba26ebc]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bbdcfeafa083cd2a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ee221464f4fea9d2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0afbd3a696cf66d42]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fba776af7d0a0ae3]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-078df85a1223aebc4]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-081c5df07b4b9db84]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-257126802]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06a85a3185ba26ebc1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06baa4459bd13abb7]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f0e15f5310f655d7]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bf35a39473ae8a36]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f9d3335249f21f49]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f790d624e974ecae]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-043d38a414d2f69b5]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a0df0b3cac51798e1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09c7fbaa592d410991080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-03615ef4987605c19",
        ]
      + subnets                                     = [
          + "subnet-0b0153885fce04ca4",
          + "subnet-0ee221464f4fea9d2",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-07206b77599279d94"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:147481072673:targetgroup/go-simple-server-target-group/96119dfc435e355c]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Creation complete after 2m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:147481072673:loadbalancer/app/go-simple-server-alb/bfc568425394aad3]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:147481072673:listener/app/go-simple-server-alb/bfc568425394aad3/a710aaca26c1737f]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:147481072673:listener-rule/app/go-simple-server-alb/bfc568425394aad3/a710aaca26c1737f/f23faae3a59d6ccb]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"aa0c3f2f85a01af75e463ed95df27b8900e37847","Vars":{},"WorkflowName":"Terraform"} -->